{
  "irVersion": "1.0",
  "project": "omnillm-bedrock",
  "repository": "https://github.com/plexusone/omnillm-bedrock",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.4.0",
      "date": "2026-03-16",
      "highlights": [
        { "description": "Organization migration from agentplexus to plexusone" }
      ],
      "breaking": [
        { "description": "Module path changed from `github.com/agentplexus/omnillm-bedrock` to `github.com/plexusone/omnillm-bedrock`", "commit": "7fba48a" }
      ],
      "upgradeGuide": [
        { "description": "Update import paths from `github.com/agentplexus/omnillm-bedrock` to `github.com/plexusone/omnillm-bedrock`" },
        { "description": "Run `go get github.com/plexusone/omnillm-bedrock@v0.4.0` to update dependency" }
      ],
      "changed": [
        { "description": "Module path migrated to `github.com/plexusone/omnillm-bedrock`", "commit": "7fba48a" },
        { "description": "Dependency updated to `github.com/plexusone/omnillm` v0.13.0", "commit": "7fba48a" }
      ],
      "dependencies": [
        { "description": "Bump `github.com/plexusone/omnillm` from v0.10.0 to v0.13.0", "commit": "7fba48a" },
        { "description": "Bump `github.com/aws/aws-sdk-go-v2/config` to v1.32.12", "commit": "de0d589" },
        { "description": "Bump `github.com/aws/aws-sdk-go-v2/service/bedrockruntime` to v1.50.2", "commit": "4dde2bc" },
        { "description": "Bump `github.com/aws/smithy-go` from v1.24.0 to v1.24.2", "commit": "6d6ce16" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "Streaming support via Bedrock ConverseStream API" },
        { "description": "Full tool/function calling with streaming tool deltas" },
        { "description": "Simplified authentication with Bedrock API keys (`AWS_BEARER_TOKEN_BEDROCK`)" },
        { "description": "Comprehensive test suite: 18 unit tests + 8 integration tests" }
      ],
      "added": [
        { "description": "Streaming support via `CreateChatCompletionStream` using Bedrock's ConverseStream API" },
        { "description": "`stream.go` with event handling for text deltas, tool use deltas, and metadata" },
        { "description": "Tool/function calling support with `ToolConfiguration` mapping" },
        { "description": "Tool choice options: auto, required, none, specific tool" },
        { "description": "Streaming tool call support with incremental argument delivery" },
        { "description": "Bearer token authentication via `AWS_BEARER_TOKEN_BEDROCK` environment variable" },
        { "description": "Integration tests (8 tests) covering completions, streaming, and tool calling" },
        { "description": "Unit tests (18 tests) with mock Bedrock client" },
        { "description": "CI/CD documentation for GitHub Actions with both auth methods" }
      ],
      "changed": [
        { "description": "README.md updated with credential chain priority table" },
        { "description": "README.md updated with testing documentation and environment variables" },
        { "description": "Bedrock model access section simplified (AWS auto-enables models on first invocation)" }
      ],
      "removed": [
        { "description": "`types.go` removed (types consolidated into other files)" }
      ],
      "dependencies": [
        { "description": "Added `github.com/aws/smithy-go` as direct dependency for bearer token support", "component": "github.com/aws/smithy-go", "componentVersion": "1.24.0" }
      ],
      "documentation": [
        { "description": "Added AWS authentication priority table with 7 credential sources" },
        { "description": "Added Bedrock API key setup instructions" },
        { "description": "Added Testing section with unit and integration test commands" },
        { "description": "Added CI/CD examples for GitHub Actions" },
        { "description": "Created ROADMAP.md with implementation phases" }
      ],
      "internal": [
        { "description": "Added `.gitignore` for credentials and IDE files" },
        { "description": "Renamed `.env.sh` to `.envrc` for direnv compatibility" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2025-12-15",
      "added": [
        { "description": "Core chat completion support via Bedrock Converse API" },
        { "description": "System message handling (extracted to Bedrock system blocks)" },
        { "description": "Multi-turn conversation support" },
        { "description": "Inference configuration (MaxTokens, Temperature, TopP, Stop)" },
        { "description": "Token usage reporting" }
      ],
      "documentation": [
        { "description": "Initial README with usage examples" },
        { "description": "AWS authentication documentation" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-12-01",
      "added": [
        { "description": "Initial release" },
        { "description": "Basic Bedrock client wrapper" },
        { "description": "Provider interface implementation for omnillm" }
      ]
    }
  ]
}
